Q1. List any five functions of the pandas library with execution.

head/tail/describe/dtype/column

In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
data = {'A':['a','b','c'],
        'B':[1,2,3],
        'C':['ryaz','zafar','azar']}

In [19]:
df =pd.DataFrame(data,index=(1,4,5))

In [20]:
df

   A  B      C
1  a  1   ryaz
4  b  2  zafar
5  c  3   azar

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [23]:
d = {'Value':[10, 20, 30, 40, 50]}

In [27]:
pd.DataFrame(d)[0:3].sum()

Value    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [45]:
t ={'Text':['abc','ab cd','c a,b']}

In [46]:
df=pd.DataFrame(t)
df

    Text
0    abc
1  ab cd
2  c a,b

In [50]:
df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))

In [51]:
df

    Text  Word_Count
0    abc           1
1  ab cd           2
2  c a,b           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

dataframe size : shows te exact number of data cell in your dataframe

dataframe shape : tell the nunber of rows and columns of a given dataframe

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel("")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [52]:
E = {'Email':['john.doe@example.com','riyazmbeig@gmail.com']}

In [54]:
df=pd.DataFrame(E)
df

                  Email
0  john.doe@example.com
1  riyazmbeig@gmail.com

In [63]:
df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])

In [64]:
df

                  Email    Username
0  john.doe@example.com    john.doe
1  riyazmbeig@gmail.com  riyazmbeig

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [67]:
a ={'A': [3, 8, 6, 2, 9],
     'B': [5, 2, 9, 3, 1],
     'C': [1, 7, 4, 5, 2]}

In [69]:
df =pd.DataFrame(a)

In [77]:
set = df[(df['A'] > 5) & (df['B'] < 10)]

In [81]:
print(set)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [82]:
v= {'Value':[10, 20, 30, 40, 50]}

In [85]:
df=pd.DataFrame(v)
df

   Value
0     10
1     20
2     30
3     40
4     50

In [95]:
df.mean()

Value    30.0
dtype: float64

In [96]:
df.median()

Value    30.0
dtype: float64

In [97]:
df.std()

Value    15.811388
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [101]:
A ={'Sales':[1,2,3,4,5,6,7],
    'Date':pd.date_range(start='2023-01-01',periods=7)}

In [103]:
df =pd.DataFrame(A)

In [105]:
df['MovingAverage'] = df['Sales'].rolling(window=7,min_periods=1).mean()

In [106]:
df

   Sales       Date  MovingAverage
0      1 2023-01-01            1.0
1      2 2023-01-02            1.5
2      3 2023-01-03            2.0
3      4 2023-01-04            2.5
4      5 2023-01-05            3.0
5      6 2023-01-06            3.5
6      7 2023-01-07            4.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [108]:
w ={'date':pd.date_range(start='2023-01-01',periods=5)}

In [110]:
df =pd.DataFrame(w)
df

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [116]:
df['Weekday'] = df['date'].dt.day_name()

In [117]:
df

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [119]:
q= {'Date':pd.date_range(start='2023-01-01',end='2023-01-31')}

In [120]:
pd.DataFrame(q)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [121]:
import pandas as pd